# Data Formating

![gif](imgs/DF002.gif)

## Import

In [1]:
import pandas as pd
import numpy as np

## Shaping

### with indexing

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2,3)), 
                    index=pd.Index(['Ohio', 'Colorado'], 
                                   name='state'), 
                    columns=pd.Index(['one', 'two', 'three'], 
                                     name='number'))
# save
result = data.stack()

data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [3]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [4]:
data.unstack()

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [5]:
data.stack().unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [6]:
data.stack('number')

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

### NA data

In [7]:
s1 = pd.Series([0,1,2,3], index=list('abcd'))
s1

a    0
b    1
c    2
d    3
dtype: int64

In [8]:
s2 = pd.Series([4,5,6], index=list('cde'))
s2

c    4
d    5
e    6
dtype: int64

In [9]:
data = pd.concat([s1, s2], keys=['one', 'two'])
data

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [10]:
data.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

### stack + unstack

### series

In [11]:
data

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [12]:
data.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

### dataframe

In [13]:
df = pd.DataFrame({'left': result, 'right': result + 5}, columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [14]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [15]:
df.unstack('number')

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [16]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## Long to wide format

In [17]:
df = pd.DataFrame([['1959-03-31 00:00:00', 'realgdp', 2710.349],
                   ['1959-03-31 00:00:00', 'infl', 0],
                   ['1959-03-31 00:00:00', 'unemp', 5.800],
                   ['1959-06-30 00:00:00', 'realgdp', 2778.801],
                   ['1959-06-30 00:00:00', 'infl', 2.340],
                   ['1959-06-30 00:00:00', 'unemp', 5.100],
                   ['1959-09-30 00:00:00', 'realgdp', 2775.488],
                   ['1959-09-30 00:00:00', 'infl', 2.740],
                   ['1959-09-30 00:00:00', 'unemp', 5.300],
                   ['1959-12-31 00:00:00', 'realgdp', 2785.204]], columns=['date', 'item', 'value'])

df

                  date     item     value
0  1959-03-31 00:00:00  realgdp  2710.349
1  1959-03-31 00:00:00     infl     0.000
2  1959-03-31 00:00:00    unemp     5.800
3  1959-06-30 00:00:00  realgdp  2778.801
4  1959-06-30 00:00:00     infl     2.340
5  1959-06-30 00:00:00    unemp     5.100
6  1959-09-30 00:00:00  realgdp  2775.488
7  1959-09-30 00:00:00     infl     2.740
8  1959-09-30 00:00:00    unemp     5.300
9  1959-12-31 00:00:00  realgdp  2785.204

In [18]:
df.pivot('date', 'item', 'value')

item                 infl   realgdp  unemp
date
1959-03-31 00:00:00  0.00  2710.349    5.8
1959-06-30 00:00:00  2.34  2778.801    5.1
1959-09-30 00:00:00  2.74  2775.488    5.3
1959-12-31 00:00:00   NaN  2785.204    NaN

### two values

In [19]:
dfn = df
dfn['value2'] = np.random.randn(len(df))
dfn

                  date     item     value    value2
0  1959-03-31 00:00:00  realgdp  2710.349  0.901355
1  1959-03-31 00:00:00     infl     0.000 -0.639710
2  1959-03-31 00:00:00    unemp     5.800 -0.221570
3  1959-06-30 00:00:00  realgdp  2778.801 -1.047204
4  1959-06-30 00:00:00     infl     2.340  0.166079
5  1959-06-30 00:00:00    unemp     5.100  0.890914
6  1959-09-30 00:00:00  realgdp  2775.488  0.024664
7  1959-09-30 00:00:00     infl     2.740  1.233034
8  1959-09-30 00:00:00    unemp     5.300 -0.767268
9  1959-12-31 00:00:00  realgdp  2785.204  0.418057

In [20]:
dfn.pivot('date', 'item')

                    value                    value2
item                 infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31 00:00:00  0.00  2710.349   5.8 -0.639710  0.901355 -0.221570
1959-06-30 00:00:00  2.34  2778.801   5.1  0.166079 -1.047204  0.890914
1959-09-30 00:00:00  2.74  2775.488   5.3  1.233034  0.024664 -0.767268
1959-12-31 00:00:00   NaN  2785.204   NaN       NaN  0.418057       NaN

In [21]:
dfn.set_index(['date', 'item']).unstack('item')

                    value                    value2
item                 infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31 00:00:00  0.00  2710.349   5.8 -0.639710  0.901355 -0.221570
1959-06-30 00:00:00  2.34  2778.801   5.1  0.166079 -1.047204  0.890914
1959-09-30 00:00:00  2.74  2775.488   5.3  1.233034  0.024664 -0.767268
1959-12-31 00:00:00   NaN  2785.204   NaN       NaN  0.418057       NaN

## Duplicates

In [22]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [23]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [25]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [26]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5